load-tests/scenario.yml
# 負荷テスト設定
# 実行: npx artillery run load-tests/scenario.yml

config:
  target: "https://ubw8w4wnp7.execute-api.ap-northeast-1.amazonaws.com/dev"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 20
      name: "Sustained load"
    - duration: 30
      arrivalRate: 50
      name: "Peak load"
  environments:
    dev:
      target: "https://ubw8w4wnp7.execute-api.ap-northeast-1.amazonaws.com/dev"
      variables:
        recordingApi: "https://tlw1w8knh7.execute-api.ap-northeast-1.amazonaws.com/dev"
        avatarApi: "https://dgjfsg2e9b.execute-api.ap-northeast-1.amazonaws.com/dev"
  variables:
    recordingApi: "https://tlw1w8knh7.execute-api.ap-northeast-1.amazonaws.com/dev"
    avatarApi: "https://dgjfsg2e9b.execute-api.ap-northeast-1.amazonaws.com/dev"
  plugins:
    expect: {}
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # シナリオ1: ログインフロー
  - name: "Login flow"
    weight: 3
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "loadtest@example.com"
            password: "LoadTest1234!"
          capture:
            - json: "$.accessToken"
              as: "token"
          expect:
            - statusCode: 200

  # シナリオ2: 記録 → アバター取得フロー（メインユースケース）
  - name: "Record activity and check avatar"
    weight: 5
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "loadtest@example.com"
            password: "LoadTest1234!"
          capture:
            - json: "$.accessToken"
              as: "token"
      - post:
          url: "{{ recordingApi }}/activities"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            records:
              - categoryId: "food_rice"
                memo: "負荷テスト記録"
          expect:
            - statusCode: 201
      - get:
          url: "{{ avatarApi }}/avatar"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "{{ avatarApi }}/avatar/score-detail"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  # シナリオ3: サマリー取得（読み取り負荷）
  - name: "Read summary"
    weight: 2
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "loadtest@example.com"
            password: "LoadTest1234!"
          capture:
            - json: "$.accessToken"
              as: "token"
      - get:
          url: "{{ recordingApi }}/activities/summary?period=today"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "{{ recordingApi }}/activities?limit=10"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200